---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
NamingUtils Members
NamingUtils Class Methods See Also Send Feedback
---

The NamingUtils type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | CompareNames | Compares two object name strings using Revit's comparison rules. |
|  | IsValidName | Identifies if the input string is valid for use as an object name in Revit. |

# See Also

NamingUtils Class

Autodesk.Revit.DB Namespace